In [1]:
import pandas as pd

### 인공지능 반

In [19]:
# 딕셔너리로 데이터 프레임 만들기
df1 = pd.DataFrame(data={
    "진로희망" : ['빅데이터분석가', '자영업','웹개발자','대학원','합계'],
    "도수" : [7,6,4,3,20]
    
})

In [20]:
df1

      진로희망  도수
0  빅데이터분석가   7
1      자영업   6
2     웹개발자   4
3      대학원   3
4       합계  20

### 빅데이터 반

In [21]:
df2 = pd.DataFrame(data={
    "진로희망" : ['빅데이터분석가', '자영업','웹개발자','대학원','합계'],
    "도수" : [12,14,10,14,50]
})

In [22]:
df2

      진로희망  도수
0  빅데이터분석가  12
1      자영업  14
2     웹개발자  10
3      대학원  14
4       합계  50

### 데이터프레임 병합

In [57]:
df_concat = pd.concat([df1,df2["도수"]],axis=1)
df_concat.columns=['진로희망', '인공지능반','빅데이터반']

In [58]:
df_concat

      진로희망  인공지능반  빅데이터반
0  빅데이터분석가      7     12
1      자영업      6     14
2     웹개발자      4     10
3      대학원      3     14
4       합계     20     50

### 상대도수 데이터 프레임 만들기

In [47]:
df_concat['인공지능반 상대 도수']=df_concat.loc[:,'인공지능반']/20

In [48]:
df_concat['빅데이터반 상대 도수']=df_concat.loc[:,'빅데이터반']/50

In [49]:
df_concat

      진로희망  인공지능반  빅데이터반  인공지능반 상대 도수  빅데이터반 상대 도수
0  빅데이터분석가      7     12         0.35         0.24
1      자영업      6     14         0.30         0.28
2     웹개발자      4     10         0.20         0.20
3      대학원      3     14         0.15         0.28
4       합계     20     50         1.00         1.00

In [55]:
df_list = pd.DataFrame([[6/20,12/50],
                        [7/20,14/50],
                        [3/20,10/50],
                        [3/20,14/50],
                        [1,1]],
                       columns=['인공지능반','빅데이터반'])

In [56]:
df_list

   인공지능반  빅데이터반
0   0.30   0.24
1   0.35   0.28
2   0.15   0.20
3   0.15   0.28
4   1.00   1.00

### 데이터 프레임 병합

In [60]:
df_rs = pd.concat([df_concat,df_list],axis=1)
df_rs

      진로희망  인공지능반  빅데이터반  인공지능반  빅데이터반
0  빅데이터분석가      7     12   0.30   0.24
1      자영업      6     14   0.35   0.28
2     웹개발자      4     10   0.15   0.20
3      대학원      3     14   0.15   0.28
4       합계     20     50   1.00   1.00

### 멀티 컬럼 작성하기

In [61]:
df_rs.columns =[["",'도수','도수','상대도수','상대도수'],
                ['진로희망','인공지능반','빅데이터반','인공지능반','빅데이터반']]

In [62]:
df_rs

              도수        상대도수
      진로희망 인공지능반 빅데이터반 인공지능반 빅데이터반
0  빅데이터분석가     7    12  0.30  0.24
1      자영업     6    14  0.35  0.28
2     웹개발자     4    10  0.15  0.20
3      대학원     3    14  0.15  0.28
4       합계    20    50  1.00  1.00

    -   도수 : 데이터의 개수
    -   상대도수 : 도수에서 전체 수를 나눈 값
    -   총 도수가 다른 두 데이터를 비교할 때 상대 도수를 이용한다.

In [68]:
df_rs.describe()

              도수               상대도수
           인공지능반    빅데이터반     인공지능반     빅데이터반
count   5.000000   5.0000  5.000000  5.000000
mean    8.000000  20.0000  0.390000  0.400000
std     6.892024  16.8523  0.352491  0.337046
min     3.000000  10.0000  0.150000  0.200000
25%     4.000000  12.0000  0.150000  0.240000
50%     6.000000  14.0000  0.300000  0.280000
75%     7.000000  14.0000  0.350000  0.280000
max    20.000000  50.0000  1.000000  1.000000

In [69]:
df_rs.quantile(q=0.25)

C:\Users\smhrd\AppData\Local\Temp\ipykernel_20776\4085745369.py:1: FutureWarning: The default value of numeric_only in DataFrame.quantile is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df_rs.quantile(q=0.25)

도수    인공지능반     4.00
      빅데이터반    12.00
상대도수  인공지능반     0.15
      빅데이터반     0.24
Name: 0.25, dtype: float64